<a href="https://colab.research.google.com/github/tewei0328/AI/blob/master/school_titanic_read_csv_%E8%B3%87%E6%96%99%E5%88%87%E7%89%87.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
df=pd.read_csv('https://raw.githubusercontent.com/tewei0328/data/master/titanic_train.csv')

In [7]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [12]:
df[['Survived']].head()

   Survived
0         0
1         1
2         1
3         1
4         0

In [10]:
df.Survived.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [11]:
df[['Survived','Sex']].head()

   Survived     Sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male